{
    "connect": "Connect with me",
    "visit-career": "Visit my career",
    "visit-skill": "Visit my skills",
    "home-primary-section-title-1": "Hi!",
    "home-primary-section-title-2": "I'm Arthur Dantas",
    "home-second-section-title": "Full Stack Software Engineer",
    "home-third-section-title": "My Soft Skills and Characteristics",
    "home-primary-section-paragraph": "I'm a Full Stack Developer, with a focus on web applications, creating highly usable, efficient, and scalable solutions. I have experience in robust projects with large systems, as well as in smaller initiatives. Applying both academic and practical concepts of Software Engineering in the industry, focusing on agile methodologies to ensure the delivery of high-quality solutions.",
    "home-second-section-paragraph": "I have a technical degree in Computer Technician from the Federal Institute of Mato Grosso do Sul and I am currently a Software Engineering student at the Federal University of Mato Grosso do Sul. Throughout my academic and professional career, I dedicate myself to full stack web development and have participated in several projects, gaining experience in the software area. I always seek to go beyond coding, focusing on problem-solving, requirements analysis, and documentation, essential aspects of Software Engineering.",
    "home-third-section-paragraph": "I have some very strong and noticeable personal characteristics. I am communicative and collaborative with the team, aiming to achieve goals in an agile way, or even collaborating with stakeholders, where communication and collaboration are essential. In addition, I have a critical thinking, always trying to predict events that may affect the course in a certain way. If the problem arises, it must be faced. As a full stack developer, I believe that adaptability is essential, which opens up a range of possibilities, including the willingness to learn continuously.",
    "footer-rights": "All rights reserved",
    "footer-message": "Arthur Dantas is a full stack software developer and a Software Engineering student at the Federal University of Mato Grosso do Sul. He resides in Campo Grande, MS, Brazil. He specializes in developing efficient and scalable web applications, focused on providing high-quality and high-performance solutions."
}
